#+TITLE: Emacs Config
#+PROPERTY: header-args emacs-lisp :tangle "~/.emacs.d/init.el"

*** Ivy-Bibtex
#+begin_src emacs-lisp
  (use-package ivy-bibtex
    :config
    (setq bibtex-completion-bibliography        "~/Dropbox/org/Research/zotLib.bib")
    (setq bibtex-completion-library-path        "~/Dropbox/org/Research/zotero-library/")
    (setq bibtex-completion-notes-path          "~/git/phd/notes/")
    (setq ivy-bibtex-default-action             'ivy-bibtex-edit-notes)
    (setq bibtex-completion-pdf-field           "file")
    (setq bibtex-completion-find-additional-pdfs t)
    (setq bibtex-completion-cite-prompt-for-optional-arguments nil)
    (setq	bibtex-completion-pdf-symbol "ρ")
    (setq	bibtex-completion-notes-symbol "η")
    (setq bibtex-completion-notes-template-multiple-files
          (concat
           "#+TITLE: ${title}\n"
           "#+CITE_KEY: ${=key=}\n"
           ":PROPERTIES:\n"
           ":Custom_ID: ${=key=}\n"
           ":AUTHOR: ${author-abbrev}\n"
           ":JOURNAL: ${journaltitle}\n"
           ":DATE: ${date}\n"
           ":YEAR: ${year}\n"
           ":DOI: ${doi}\n"
           ":URL: ${url}\n"
           ":END:\n\n")))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24555 39209 448663 0) :init (24555 39209 448659 0) :config (24555 39209 448653 0) :config-secs (0 0 4 0) :init-secs (0 0 12 0) :use-package-secs (0 0 57 0)))

** Org-Noter
#+begin_src emacs-lisp
  (use-package org-noter
    :config
    (setq org-noter-default-notes-file-names  '("notes.org"))
    (setq org-noter-notes-search-path         '("~/git/phd/notes"))
    (setq org-noter-auto-save-last-location   t)
    (setq org-noter-always-create-frame       nil)
    (setq org-noter-insert-note-no-questions  t)
    (setq org-noter-notes-window-location     'horizontal-split))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24555 38012 284150 0) :init (24555 38012 284147 0) :config (24555 38012 284142 0) :config-secs (0 0 4 0) :init-secs (0 0 11 0) :use-package-secs (0 0 58 0)))

